# ! CreeperPlan   python
#  44719
# -*- coding: utf-8 -*-
# coding=utf-8
# @Time    : 2022/4/26 14:31
# @Author  : 傑君
# @File    : main.py
# @Software: PyCharm
import os
import sys

from PySide6 import QtWidgets, QtGui, QtCore
from PySide6.QtCore import Qt
from PySide6.QtGui import QIcon
from PySide6.QtWidgets import QCompleter, QMainWindow

from need.changePasswd import Ui_changePasswd
from need.changePasswd_page import changePasswd_method
from need.creeper_page import creeper_method, browser
from need.enroll import Ui_Form
from need.login import Ui_LoginDialog
from need.login_page import login_method
from need.mainWindowCreeper import Ui_MainWindow
from need.share import SI
# 打包代码
# pyinstaller -w main.py -p login_page.py -p creeper_page.py -p .\lib\share.py --noconsole --hidden-import PySide2.QtXml --hidden-import PySide2 --hidden-import xlsxwriter --hidden-import selenium --hidden-import pandas --hidden-import win32com --icon="spider.ico" --add-data=".\ui\*.ui;."  --add-data="chromedriver.exe;."
from need.signIn_page import signIn_method


class win_Login(QMainWindow):
    def __init__(self):
        print("CreeperPlan-loginPage")
        # self.ui = QUiLoader().load("./ui/login.ui")
        super(win_Login, self).__init__()
        self.ui = Ui_LoginDialog()
        self.ui.setupUi(self)
        # 方法绑定
        self.login_m = login_method()
        self.login_m.ui = self.ui
        self.ui.loginPushButton.clicked.connect(self.login_m.login_button)
        self.ui.registerPushButton.clicked.connect(self.login_m.register_button)
        pix = QtGui.QPixmap('background.png')
        self.ui.label_4.setScaledContents(True)
        self.ui.label_4.setPixmap(pix)
        self.ui.btn_accountsTopUp.clicked.connect(self.login_m.topUP_button)


class win_SignIn(QMainWindow):
    def __init__(self):
        print("CreeperPlan-signInPage")
        super(win_SignIn, self).__init__()
        self.ui = Ui_Form()
        self.ui.setupUi(self)
        # 设置
        self.signIn_m = signIn_method()
        self.signIn_m.ui = self.ui
        # 用户名
        user_regex = QtCore.QRegularExpression("[a-zA-Z][a-zA-Z0-9_]{2,15}$")
        user_validator = QtGui.QRegularExpressionValidator(user_regex, self.ui.le_user)
        self.ui.le_user.setValidator(user_validator)
        # 密码
        passwd_regex = QtCore.QRegularExpression("[a-zA-Z][a-zA-Z0-9_]{2,15}$")
        passwd_validator = QtGui.QRegularExpressionValidator(passwd_regex, self.ui.le_password)
        self.ui.le_password.setValidator(passwd_validator)
        # 名字
        name_regex = QtCore.QRegularExpression("[\u4E00-\u9FA5A-Za-z0-9_]+$")
        name_validator = QtGui.QRegularExpressionValidator(name_regex, self.ui.le_name)
        self.ui.le_name.setValidator(name_validator)
        # 手机号
        phone_regex = QtCore.QRegularExpression(
            "(13[0-9]|14[01456879]|15[0-35-9]|16[2567]|17[0-8]|18[0-9]|19[0-35-9])\d{8}$")
        phone_validator = QtGui.QRegularExpressionValidator(phone_regex, self.ui.le_phone)
        self.ui.le_phone.setValidator(phone_validator)
        # 注册方法
        self.ui.btn_enroll.clicked.connect(self.signIn_m.signIn_button)
        # 返回方法
        self.ui.btn_return.clicked.connect(self.signIn_m.return_button)


class win_CreeperMain(QMainWindow):
    def __init__(self):
        # 省级
        provincial_Level = ['全国', '北京', '天津', '河北', '山西', '内蒙古', '辽宁', '吉林', '黑龙江', '上海', '江苏', '浙江', '安徽', '福建', '江西',
                            '山东', '河南', '湖北', '湖南', '广东', '广西', '海南', '重庆', '四川', '贵州', '云南', '西藏', '陕西', '甘肃', '青海',
                            '宁夏', '新疆', '台湾', '香港', '澳门']

        # 信息
        information_list = ['全部信息', '招标公告', '标书下载', '中标结果', '招标预告', '招标变更', 'VIP独家', '拟在建项目', '土地挂牌', '审批公示', '拍卖转让',
                            '免费信息']

        # 项目金额选项
        itemAmount_list = ['全部', '500万以下', '500-1000万', '1000-5000万', '5000万以上']

        # 采购方式选项
        acquisitionMethods_list = ['全部', '公开招标', '邀请招标', '竞争性', '询价', '单一来源', '比选', '电子反拍']

        # 资金来源
        capitalSource_list = ['全部', '自筹资金', '政府投资']

        # 评标办法
        bidEvaluationMethod_list = ['全部', '综合', '低价', '抽签']

        # 资质证书
        qualificationCertificate_list = ['全部', '国军标认证', '质量管理体系', '环境管理体系', '职业健康安全管理体系', '测量管理体系', '能源管理体系', '整合管理体系',
                                         '合规管理体系', '诚信管理体系', '业务连续性管理体系', '道路交通安全管理体系', '知识产权管理体系', '信息安全管理体系',
                                         '食品农产品管理体系', '供应链安全管理体系', '危害分析与关键控制点', '可持续性发展管理体系', '企业社会责任管理体系',
                                         '信息技术服务管理体系', 'HSE-健康安全管理体系', '企业信用等级', '企业资信等级', '质量服务诚信单位', '重合同守信用企业',
                                         '诚信经营示范单位', '重质量守信用企业', '重服务守信用企业', '诚信供应商证书', '诚信企业家证书', '政府采购优秀供应商',
                                         '售后服务认证', '清洁服务认证', '物业服务认证', '保安服务认证', '餐饮服务认证', '有害物质限量认证', '建筑工程服务认证',
                                         '绿色供应链评价', '标准化良好行为企业', 'LA劳安认证', '有机产品认证', '绿色食品认证', '节水认证证书', '节能产品认证',
                                         '绿色产品认证', '环保产品认证', '环境标志产品认证', '卫生安全产品认证', '建筑工程施工总承包资质一级', '建筑工程施工总承包资质二级',
                                         '建筑工程施工总承包资质三级', '建筑装修装饰工程专业承包资质一级', '建筑装修装饰工程专业承包资质二级', '电力工程施工总承包资质一级',
                                         '电力工程施工总承包资质二级', '电力工程施工总承包资质三级', '城乡规划编制单位资质甲级', '城乡规划编制单位资质乙级',
                                         '城乡规划编制单位资质丙级', '城市园林绿化企业资质一级', '城市园林绿化企业资质二级', '城市园林绿化企业资质三级',
                                         '城市园林绿化企业资质三级资质以下', '房地产资质等级一级', '房地产资质等级二级', '房地产资质等级三级', '房地产资质等级四级',
                                         '房屋建筑工程监理甲级', '房屋建筑工程监理乙级', '房屋建筑工程监理丙级', '冶炼工程监理甲级', '冶炼工程监理乙级', '矿山工程监理甲级',
                                         '矿山工程监理乙级', '化工石油工程监理甲级', '化工石油工程监理乙级', '水利水电工程监理甲级', '水利水电工程监理乙级',
                                         '水利水电工程监理丙级', '农林工程监理甲级', '农林工程监理乙级', '铁路工程监理甲级', '铁路工程监理乙级', '公路工程监理甲级',
                                         '公路工程监理乙级', '公路工程监理丙级', '港口与航道工程监理甲级', '港口与航道工程监理乙级', '航天航空工程监理甲级',
                                         '航天航空工程监理乙级', '通信工程监理甲级', '通信工程监理乙级', '市政公用工程监理甲级', '市政公用工程监理乙级', '市政公用工程监理丙级',
                                         '机电安装工程监理甲级', '机电安装工程监理乙级', '工程监理综合甲级', '轻型钢结构工程设计专项资质甲级', '轻型钢结构工程设计专项资质乙级',
                                         '建筑幕墙工程设计专项资质甲级', '建筑幕墙工程设计专项资质乙级', '建筑智能化系统设计专项资质甲级', '建筑智能化系统设计专项资质乙级',
                                         '建筑装饰工程设计专项资质甲级', '建筑装饰工程设计专项资质乙级', '风景园林工程设计专项资质甲级', '风景园林工程设计专项资质乙级',
                                         '消防设施工程设计专项资质甲级', '消防设施工程设计专项资质乙级', '环境工程设计专项资质（水污染防治工程）甲级',
                                         '环境工程设计专项资质（水污染防治工程）乙级', '照明工程设计专项资质甲级', '照明工程设计专项资质乙级', '工程造价咨询资质甲级',
                                         '工程造价咨询资质乙级', '工程造价咨询资质暂定乙级', '工程招标代理甲级', '工程招标代理乙级', '工程招标代理暂定级',
                                         '市政公用工程施工总承包资质特级', '市政公用工程施工总承包资质一级', '市政公用工程施工总承包资质二级', '市政公用工程施工总承包资质三级',
                                         '石油化工工程施工总承包资质特级', '石油化工工程施工总承包资质一级', '石油化工工程施工总承包资质二级', '石油化工工程施工总承包资质三级',
                                         '冶金工程施工总承包资质特级', '冶金工程施工总承包资质一级', '冶金工程施工总承包资质二级', '冶金工程施工总承包资质三级',
                                         '公路工程施工总承包资质特级', '公路工程施工总承包资质一级', '公路工程施工总承包资质二级', '公路工程施工总承包资质三级',
                                         '矿山工程施工总承包资质特级', '矿山工程施工总承包资质一级', '矿山工程施工总承包资质二级', '矿山工程施工总承包资质三级',
                                         '港口与航道工程施工总承包资质特级', '港口与航道工程施工总承包资质一级', '港口与航道工程施工总承包资质二级', '港口与航道工程施工总承包资质三级',
                                         '通信工程施工总承包资质一级', '通信工程施工总承包资质二级', '通信工程施工总承包资质三级', '铁路工程施工总承包资质一级',
                                         '铁路工程施工总承包资质二级', '铁路工程施工总承包资质三级', '机电工程施工总承包资质一级', '机电工程施工总承包资质二级',
                                         '机电工程施工总承包资质三级', '水利水电工程施工总承包资质特级', '水利水电工程施工总承包资质一级', '水利水电工程施工总承包资质二级',
                                         '水利水电工程施工总承包资质三级', '物业管理企业资质等级一级', '物业管理企业资质等级二级', '物业管理企业资质等级三级',
                                         '安防工程企业资质一级', '安防工程企业资质二级', '安防工程企业资质三级', '建筑装饰装修工程设计与施工一体化资质一级',
                                         '建筑装饰装修工程设计与施工一体化资质二级', '建筑装饰装修工程设计与施工一体化资质三级', '建筑幕墙工程设计与施工一体化资质一级',
                                         '建筑幕墙工程设计与施工一体化资质二级', '消防设施工程设计与施工一体化资质一级', '消防设施工程设计与施工一体化资质二级', '施工劳务企业资质',
                                         '架线作业分包企业资质', '水暖电安装作业分包企业资质', '焊接作业分包企业资质一级', '焊接作业分包企业资质二级', '模板作业分包企业资质一级',
                                         '模板作业分包企业资质二级', '脚手架作业分包企业资质一级', '脚手架作业分包企业资质二级', '钢筋作业分包企业资质一级',
                                         '钢筋作业分包企业资质二级', '钣金作业分包企业资质', '混凝土作业分包企业资质', '油漆作业分包企业资质', '抹灰作业分包企业资质',
                                         '石制作分包企业资质', '砌筑作业分包企业资质一级', '砌筑作业分包企业资质二级', '木工作业分包资质一级', '木工作业分包资质二级',
                                         '中央投资项目招标代理资格甲级', '中央投资项目招标代理资格乙级', '中央投资项目招标代理资格预备级', '建筑机电安装工程专业承包资质一级',
                                         '建筑机电安装工程专业承包资质二级', '建筑机电安装工程专业承包资质三级', '电子与智能化工程专业承包资质一级', '电子与智能化工程专业承包资质二级',
                                         '城市及道路照明工程专业承包资质一级', '城市及道路照明工程专业承包资质二级', '城市及道路照明工程专业承包资质三级',
                                         '防水防腐保温工程专业承包资质一级', '防水防腐保温工程专业承包资质二级', '环保工程专业承包资质一级', '环保工程专业承包资质二级',
                                         '环保工程专业承包资质三级', '钢结构工程专业承包资质一级', '钢结构工程专业承包资质二级', '钢结构工程专业承包资质三级',
                                         '建筑幕墙工程专业承包资质一级', '建筑幕墙工程专业承包资质二级', '消防设施工程专业承包资质一级', '消防设施工程专业承包资质二级',
                                         '地基基础工程专业承包资质一级', '地基基础工程专业承包资质二级', '地基基础工程专业承包资质三级', '输变电工程专业承包资质一级',
                                         '输变电工程专业承包资质二级', '输变电工程专业承包资质三级', '机场场道工程专业承包资质一级', '机场场道工程专业承包资质二级',
                                         '特种工程专业承包资质', '铁路电气化工程专业承包资质一级', '铁路电气化工程专业承包资质二级', '铁路电气化工程专业承包资质三级',
                                         '铁路铺轨架梁工程专业承包资质一级', '铁路铺轨架梁工程专业承包资质二级', '隧道工程专业承包资质一级', '隧道工程专业承包资质二级',
                                         '隧道工程专业承包资质三级', '铁路电务工程专业承包资质一级', '铁路电务工程专业承包资质二级', '铁路电务工程专业承包资质三级',
                                         '桥梁工程专业承包资质一级', '桥梁工程专业承包资质二级', '桥梁工程专业承包资质三级', '河湖整治工程专业承包资质一级',
                                         '河湖整治工程专业承包资质二级', '河湖整治工程专业承包资质三级', '港航设备安装及水上交管工程专业承包资质一级',
                                         '港航设备安装及水上交管工程专业承包资质二级', '港航设备安装及水上交管工程专业承包资质三级', '海洋石油工程专业承包资质一级',
                                         '海洋石油工程专业承包资质二级', '核工程专业承包资质一级', '核工程专业承包资质二级', '港口与海岸工程专业承包资质一级',
                                         '港口与海岸工程专业承包资质二级', '港口与海岸工程专业承包资质三级', '航道工程专业承包资质一级', '航道工程专业承包资质二级',
                                         '航道工程专业承包资质三级', '公路路基工程专业承包资质一级', '公路路基工程专业承包资质二级', '公路路基工程专业承包资质三级',
                                         '公路路面工程专业承包资质一级', '公路路面工程专业承包资质二级', '公路路面工程专业承包资质三级', '模板脚手架专业承包资质',
                                         '古建筑工程专业承包资质一级', '古建筑工程专业承包资质二级', '古建筑工程专业承包资质三级', '起重设备安装工程专业承包资质一级',
                                         '起重设备安装工程专业承包资质二级', '起重设备安装工程专业承包资质三级', '预拌混凝土专业承包资质', '通航建筑物工程专业承包一级',
                                         '通航建筑物工程专业承包二级', '通航建筑物工程专业承包三级', '水工金属结构制作与安装工程专业承包资质一级',
                                         '水工金属结构制作与安装工程专业承包资质二级', '水工金属结构制作与安装工程专业承包资质三级', '水利水电机电安装工程专业承包资质一级',
                                         '水利水电机电安装工程专业承包资质二级', '水利水电机电安装工程专业承包资质三级', '机场目视助航工程专业承包资质一级',
                                         '机场目视助航工程专业承包资质二级', '民航空管工程及机场弱电系统工程专业承包资质一级', '民航空管工程及机场弱电系统工程专业承包资质二级',
                                         '建筑智能化工程专业承包企业资质一级', '建筑智能化工程专业承包企业资质二级', '建筑智能化工程专业承包企业资质三级',
                                         '金属门窗工程专业承包企业资质一级', '金属门窗工程专业承包企业资质二级', '金属门窗工程专业承包企业资质三级',
                                         '体育场地设施工程专业承包企业资质一级', '体育场地设施工程专业承包企业资质二级', '体育场地设施工程专业承包企业资质三级',
                                         '管道工程专业承包企业资质一级', '管道工程专业承包企业资质二级', '管道工程专业承包企业资质三级', '混凝土预制构件专业企业二级',
                                         '混凝土预制构件专业企业三级', '堤防工程专业承包企业资质一级', '堤防工程专业承包企业资质二级', '堤防工程专业承包企业资质三级',
                                         '水工建筑物基础处理工程专业承包资质一级', '水工建筑物基础处理工程专业承包资质二级', '水工建筑物基础处理工程专业承包资质三级',
                                         '电梯安装工程专业承包企业资质一级', '电梯安装工程专业承包企业资质二级', '电梯安装工程专业承包企业资质三级',
                                         '公路交通工程专业承包企业资质（公路机电工程分项）一级', '公路交通工程专业承包企业资质（公路机电工程分项）二级',
                                         '公路交通工程专业承包企业资质（公路安全设施分项）一级', '公路交通工程专业承包企业资质（公路安全设施分项）二级',
                                         '爆破与拆除工程专业承包企业资质一级', '爆破与拆除工程专业承包企业资质二级', '爆破与拆除工程专业承包企业资质三级',
                                         '无损检测工程专业承包企业资质一级', '无损检测工程专业承包企业资质二级', '无损检测工程专业承包企业资质三级',
                                         '高耸构筑物工程专业承包企业资质一级', '高耸构筑物工程专业承包企业资质二级', '高耸构筑物工程专业承包企业资质三级',
                                         '城市轨道交通工程专业承包企业资质', '预应力工程专业承包企业资质二级', '预应力工程专业承包企业资质三级',
                                         '化工石油设备管道安装工程专业承包企业资质一级', '化工石油设备管道安装工程专业承包企业资质二级', '化工石油设备管道安装工程专业承包企业资质三级',
                                         '炉窑工程专业承包企业资质一级', '炉窑工程专业承包企业资质二级', '冶炼机电设备安装工程专业承包资质一级', '冶炼机电设备安装工程专业承包资质二级',
                                         '火电设备安装工程专业承包企业资质二级', '火电设备安装工程专业承包企业资质三级', '水工隧洞工程专业承包企业资质一级',
                                         '水工隧洞工程专业承包企业资质二级', '水工隧洞工程专业承包企业资质三级', '水工大坝工程专业承包企业资质一级', '水工大坝工程专业承包企业资质二级',
                                         '水工大坝工程专业承包企业资质三级', '土石方工程专业承包企业资质一级', '土石方工程专业承包企业资质二级', '土石方工程专业承包企业资质三级',
                                         '承装类承装（修、试）电力设施许可证一级', '承装类承装（修、试）电力设施许可证二级', '承装类承装（修、试）电力设施许可证三级',
                                         '承装类承装（修、试）电力设施许可证四级', '承装类承装（修、试）电力设施许可证五级', '承修类承装（修、试）电力设施许可证一级',
                                         '承修类承装（修、试）电力设施许可证二级', '承修类承装（修、试）电力设施许可证三级', '承修类承装（修、试）电力设施许可证四级',
                                         '承修类承装（修、试）电力设施许可证五级', '承试类承装（修、试）电力设施许可证一级', '承试类承装（修、试）电力设施许可证二级',
                                         '承试类承装（修、试）电力设施许可证三级', '承试类承装（修、试）电力设施许可证四级', '承试类承装（修、试）电力设施许可证五级',
                                         '工程设计综合资质甲级', '建筑行业甲级', '建筑行业乙级', '建筑行业(建筑工程)专业甲级', '建筑行业(建筑工程)专业乙级',
                                         '建筑行业(建筑工程)专业丙级', '建筑行业(建筑工程)专业丁级', '建筑行业(人防工程)专业甲级', '建筑行业(人防工程)专业乙级',
                                         '煤炭行业甲级', '煤炭行业乙级', '煤炭行业(矿井)专业甲级', '煤炭行业(矿井)专业乙级', '煤炭行业(露天矿)专业甲级',
                                         '煤炭行业(露天矿)专业乙级', '煤炭行业(选煤厂)专业甲级', '煤炭行业(选煤厂)专业乙级', '水利行业甲级', '水利行业乙级',
                                         '水利行业丙级', '水利行业(水库枢纽)专业甲级', '水利行业(水库枢纽)专业乙级', '水利行业(水库枢纽)专业丙级',
                                         '水利行业(引调水)专业甲级', '水利行业(引调水)专业乙级', '水利行业(引调水)专业丙级', '水利行业(灌溉排涝)专业甲级',
                                         '水利行业(灌溉排涝)专业乙级', '水利行业(灌溉排涝)专业丙级', '水利行业(河道整治)专业甲级', '水利行业(河道整治)专业乙级',
                                         '水利行业(河道整治)专业丙级', '水利行业(城市防洪)专业甲级', '水利行业(城市防洪)专业乙级', '水利行业(城市防洪)专业丙级',
                                         '水利行业(围垦)专业甲级', '水利行业(围垦)专业乙级', '水利行业(围垦)专业丙级', '水利行业(水土保持)专业甲级',
                                         '水利行业(水土保持)专业乙级', '水利行业(水土保持)专业丙级', '水利行业(水文设施)专业甲级', '水利行业(水文设施)专业乙级',
                                         '海洋行业甲级', '海洋行业乙级', '海洋行业(沿岸工程)专业甲级', '海洋行业(沿岸工程)专业乙级', '海洋行业(离岸工程)专业甲级',
                                         '海洋行业(离岸工程)专业乙级', '海洋行业(海水利用)专业甲级', '海洋行业(海水利用)专业乙级', '海洋行业(海洋能利用)专业乙级',
                                         '农林行业(农业工程)甲级', '农林行业(农业工程)乙级', '农林行业(林业工程)甲级', '农林行业(林业工程)乙级',
                                         '农林行业(农业综合开发生态工程)专业甲级', '农林行业(农业综合开发生态工程)专业乙级', '农林行业(种植业工程)专业甲级',
                                         '农林行业(种植业工程)专业乙级', '农林行业(兽医/畜牧工程)专业甲级', '农林行业(兽医/畜牧工程)专业乙级',
                                         '农林行业(渔港/渔业工程)专业甲级', '农林行业(渔港/渔业工程)专业乙级', '农林行业(设施农业工程)专业甲级',
                                         '农林行业(设施农业工程)专业乙级', '农林行业(林产工业工程)专业甲级', '农林行业(林产工业工程)专业乙级', '农林行业(林产化学工程)专业甲级',
                                         '农林行业(林产化学工程)专业乙级', '农林行业(营造林工程)专业甲级', '农林行业(营造林工程)专业乙级', '农林行业(森林资源环境工程)专业甲级',
                                         '农林行业(森林资源环境工程)专业乙级', '农林行业(森林工业工程)专业甲级', '农林行业(森林工业工程)专业乙级', '市政行业甲级',
                                         '市政行业乙级', '市政行业(燃气工程、轨道交通工程除外)甲级', '市政行业(燃气工程、轨道交通工程除外)乙级', '市政行业(给水工程)专业甲级',
                                         '市政行业(给水工程)专业乙级', '市政行业(给水工程)专业丙级', '市政行业(排水工程)专业甲级', '市政行业(排水工程)专业乙级',
                                         '市政行业(排水工程)专业丙级', '市政行业(城镇燃气工程)专业甲级', '市政行业(城镇燃气工程)专业乙级', '市政行业(城镇燃气工程)专业丙级',
                                         '市政行业(热力工程)专业甲级', '市政行业(热力工程)专业乙级', '市政行业(热力工程)专业丙级', '市政行业(道路工程)专业甲级',
                                         '市政行业(道路工程)专业乙级', '市政行业(道路工程)专业丙级', '市政行业(桥梁工程)专业甲级', '市政行业(桥梁工程)专业乙级',
                                         '市政行业(城市隧道工程)专业甲级', '市政行业(公共交通工程)专业甲级', '市政行业(公共交通工程)专业乙级', '市政行业(载人索道)专业甲级',
                                         '市政行业(轨道交通工程)专业甲级', '市政行业(环境卫生工程)专业甲级', '市政行业(环境卫生工程)专业乙级', '市政行业(环境卫生工程)专业丙级',
                                         '民航行业甲级', '民航行业乙级', '民航行业(机场总体规划工程)专业甲级', '民航行业(场道、目视助航工程)专业甲级',
                                         '民航行业(通信、导航、航管及航站楼弱电工程)专业甲级', '民航行业(供油工程)专业甲级', '水运行业甲级', '水运行业乙级',
                                         '水运行业(港口工程)专业甲级', '水运行业(港口工程)专业乙级', '水运行业(航道工程)专业甲级', '水运行业(航道工程)专业乙级',
                                         '水运行业(通航建筑工程)专业甲级', '水运行业(通航建筑工程)专业乙级', '水运行业(修造船厂水工工程)专业甲级',
                                         '水运行业(修造船厂水工工程)专业乙级', '水运行业(港口装卸工艺)专业甲级', '水运行业(港口装卸工艺)专业乙级',
                                         '水运行业(水上交通管制工程)专业甲级', '水运行业(水上交通管制工程)专业乙级', '公路行业甲级', '公路行业(公路)专业甲级',
                                         '公路行业(公路)专业乙级', '公路行业(公路)专业丙级', '公路行业(特大桥梁)专业甲级', '公路行业(特长隧道)专业甲级',
                                         '公路行业(交通工程)专业甲级', '公路行业(交通工程)专业乙级', '铁道行业甲（Ⅰ）级', '铁道行业甲（Ⅱ）级', '铁道行业乙级',
                                         '铁道行业（桥梁）专业甲级', '铁道行业（轨道）专业甲级', '铁道行业（隧道）专业甲级', '铁道行业（电气化）专业甲级',
                                         '铁道行业（通信信号）专业甲级', '建材行业甲级', '建材行业乙级', '建材行业(水泥工程)专业甲级', '建材行业(水泥工程)专业乙级',
                                         '建材行业(玻璃、陶瓷、耐火材料工程)专业甲级', '建材行业(玻璃、陶瓷、耐火材料工程)专业乙级', '建材行业(新型建筑材料工程)专业甲级',
                                         '建材行业(新型建筑材料工程)专业乙级', '建材行业(非金属矿及原料制备工程)专业甲级', '建材行业(非金属矿及原料制备工程)专业乙级',
                                         '建材行业(无机非金属材料及制品工程)专业甲级', '建材行业(无机非金属材料及制品工程)专业乙级', '轻纺行业(轻工工程)甲级',
                                         '轻纺行业(轻工工程)乙级', '轻纺行业(纺织工程)甲级', '轻纺行业(纺织工程)乙级', '轻纺行业(制浆造纸工程)专业甲级',
                                         '轻纺行业(制浆造纸工程)专业乙级', '轻纺行业(制糖工程)专业甲级', '轻纺行业(制糖工程)专业乙级', '轻纺行业(食品发酵烟草工程)专业甲级',
                                         '轻纺行业(食品发酵烟草工程)专业乙级', '轻纺行业(日化及塑料工程)专业甲级', '轻纺行业(日化及塑料工程)专业乙级',
                                         '轻纺行业(日用硅酸盐工程)专业甲级', '轻纺行业(日用硅酸盐工程)专业乙级', '轻纺行业(制盐与盐化工程)专业甲级',
                                         '轻纺行业(制盐与盐化工程)专业乙级', '轻纺行业(皮革毛皮及制品)专业甲级', '轻纺行业(皮革毛皮及制品)专业乙级',
                                         '轻纺行业(家电电子与日用机械)专业甲级', '轻纺行业(家电电子与日用机械)专业乙级', '轻纺行业(纺织工程)专业甲级',
                                         '轻纺行业(纺织工程)专业乙级', '轻纺行业(印染工程)专业甲级', '轻纺行业(印染工程)专业乙级', '轻纺行业(服装工程)专业甲级',
                                         '轻纺行业(服装工程)专业乙级', '轻纺行业(化纤原料工程)专业甲级', '轻纺行业(化纤原料工程)专业乙级', '轻纺行业(化纤工程)专业甲级',
                                         '轻纺行业(化纤工程)专业乙级', '电子通信广电行业（电子工程）甲级', '电子通信广电行业（电子工程）乙级', '电子通信广电行业（通信工程）甲级',
                                         '电子通信广电行业（通信工程）乙级', '电子通信广电行业（广电工程）甲级', '电子通信广电行业（广电工程）乙级',
                                         '电子通信广电行业(电子工程类(电子整机产品项目工程))专业甲级', '电子通信广电行业(电子工程类(电子整机产品项目工程))专业乙级',
                                         '电子通信广电行业(电子工程类(电子基础产品项目工程))专业甲级', '电子通信广电行业(电子工程类(电子基础产品项目工程))专业乙级',
                                         '电子通信广电行业(电子工程类(显示器件项目工程))专业甲级', '电子通信广电行业(电子工程类(显示器件项目工程))专业乙级',
                                         '电子通信广电行业(电子工程类(微电子产品项目工程))专业甲级', '电子通信广电行业(电子工程类(微电子产品项目工程))专业乙级',
                                         '电子通信广电行业(电子工程类(电子特种环境工程))专业甲级', '电子通信广电行业(电子工程类(电子特种环境工程))专业乙级',
                                         '电子通信广电行业(电子工程类(电子系统工程))专业甲级', '电子通信广电行业(电子工程类(电子系统工程))专业乙级',
                                         '电子通信广电行业(通信工程类(有线通信))专业甲级', '电子通信广电行业(通信工程类(有线通信))专业乙级',
                                         '电子通信广电行业(通信工程类(无线通信))专业甲级', '电子通信广电行业(通信工程类(无线通信))专业乙级',
                                         '电子通信广电行业(通信工程类(邮政工程))专业甲级', '电子通信广电行业(通信工程类(邮政工程))专业乙级',
                                         '电子通信广电行业(通信工程类(通信铁塔))专业甲级', '电子通信广电行业(通信工程类(通信铁塔))专业乙级',
                                         '电子通信广电行业(广电工程类(广播电视中心))专业甲级', '电子通信广电行业(广电工程类(广播电视中心))专业乙级',
                                         '电子通信广电行业(广电工程类(广播电视发射))专业甲级', '电子通信广电行业(广电工程类(广播电视发射))专业乙级',
                                         '电子通信广电行业(广电工程类(广播电视传输))专业甲级', '电子通信广电行业(广电工程类(广播电视传输))专业乙级',
                                         '电子通信广电行业(广电工程类(电影工程))专业甲级', '电子通信广电行业(广电工程类(电影工程))专业乙级', '商物粮行业甲级', '商物粮行业乙级',
                                         '商物粮行业(冷冻冷藏工程)专业甲级', '商物粮行业(冷冻冷藏工程)专业乙级', '商物粮行业(肉食品加工工程)专业甲级',
                                         '商物粮行业(肉食品加工工程)专业乙级', '商物粮行业(批发配送与物流仓储工程)专业甲级', '商物粮行业(批发配送与物流仓储工程)专业乙级',
                                         '商物粮行业(成品油储运工程)专业甲级', '商物粮行业(成品油储运工程)专业乙级', '商物粮行业(粮食工程)专业甲级',
                                         '商物粮行业(粮食工程)专业乙级', '商物粮行业(油脂工程)专业甲级', '商物粮行业(油脂工程)专业乙级', '机械行业甲级', '机械行业乙级',
                                         '机械行业(通用设备制造业工程)专业甲级', '机械行业(通用设备制造业工程)专业乙级', '机械行业(专用设备制造业工程)专业甲级',
                                         '机械行业(专用设备制造业工程)专业乙级', '机械行业(交通运输设备制造业工程)专业甲级', '机械行业(交通运输设备制造业工程)专业乙级',
                                         '机械行业(电气机械设备制造业工程)专业甲级', '机械行业(电气机械设备制造业工程)专业乙级', '机械行业(金属制品业工程)专业甲级',
                                         '机械行业(金属制品业工程)专业乙级', '机械行业(仪器仪表及文化办公机械制造工程)专业甲级', '机械行业(仪器仪表及文化办公机械制造工程)专业乙级',
                                         '机械行业(机械加工)专业甲级', '机械行业(机械加工)专业乙级', '机械行业(热加工)专业甲级', '机械行业(热加工)专业乙级',
                                         '机械行业(表面处理)专业甲级', '机械行业(表面处理)专业乙级', '机械行业(检测)专业甲级', '机械行业(检测)专业乙级',
                                         '机械行业(物料搬运及仓储)专业甲级', '机械行业(物料搬运及仓储)专业乙级', '冶金行业甲级', '冶金行业乙级',
                                         '冶金行业(金属冶炼工程)专业甲级', '冶金行业(金属冶炼工程)专业乙级', '冶金行业(金属材料工程)专业甲级', '冶金行业(金属材料工程)专业乙级',
                                         '冶金行业(焦化和耐火材料工程)专业甲级', '冶金行业(焦化和耐火材料工程)专业乙级', '冶金行业(冶金矿工程)专业甲级',
                                         '冶金行业(冶金矿工程)专业乙级', '电力行业甲级', '电力行业乙级', '电力行业(火力发电（含核电站常规岛设计）)专业甲级',
                                         '电力行业(火力发电（含核电站常规岛设计）)专业乙级', '电力行业(水力发电（含抽水蓄能潮汐）)专业甲级',
                                         '电力行业(水力发电（含抽水蓄能潮汐）)专业乙级', '电力行业(风力发电)专业甲级', '电力行业(风力发电)专业乙级',
                                         '电力行业(新能源发电)专业甲级', '电力行业(新能源发电)专业乙级', '电力行业(送电工程)专业甲级', '电力行业(送电工程)专业乙级',
                                         '电力行业(送电工程)专业丙级', '电力行业(变电工程)专业甲级', '电力行业(变电工程)专业乙级', '电力行业(变电工程)专业丙级',
                                         '石油天然气（海洋石油）行业甲级', '石油天然气（海洋石油）行业乙级', '石油天然气（海洋石油）行业(油田地面)专业甲级',
                                         '石油天然气（海洋石油）行业(油田地面)专业乙级', '石油天然气（海洋石油）行业(气田地面)专业甲级',
                                         '石油天然气（海洋石油）行业(气田地面)专业乙级', '石油天然气（海洋石油）行业(管道输送)专业甲级',
                                         '石油天然气（海洋石油）行业(管道输送)专业乙级', '石油天然气（海洋石油）行业(海洋石油)专业甲级',
                                         '石油天然气（海洋石油）行业(海洋石油)专业乙级', '石油天然气（海洋石油）行业(油气库)专业甲级', '石油天然气（海洋石油）行业(油气库)专业乙级',
                                         '石油天然气（海洋石油）行业(油气加工)专业甲级', '石油天然气（海洋石油）行业(油气加工)专业乙级',
                                         '石油天然气（海洋石油）行业(石油机械制造与修理)专业甲级', '石油天然气（海洋石油）行业(石油机械制造与修理)专业乙级', '化工石化医药行业甲级',
                                         '化工石化医药行业乙级', '化工石化医药行业(炼油工程)专业甲级', '化工石化医药行业(炼油工程)专业乙级', '化工石化医药行业(化工工程)专业甲级',
                                         '化工石化医药行业(化工工程)专业乙级', '化工石化医药行业(石油及化工产品储运)专业甲级', '化工石化医药行业(石油及化工产品储运)专业乙级',
                                         '化工石化医药行业(化工矿山)专业甲级', '化工石化医药行业(化工矿山)专业乙级', '化工石化医药行业(生物、生物药)专业甲级',
                                         '化工石化医药行业(生物、生物药)专业乙级', '化工石化医药行业(化学原料药)专业甲级', '化工石化医药行业(化学原料药)专业乙级',
                                         '化工石化医药行业(中成药)专业甲级', '化工石化医药行业(中成药)专业乙级', '化工石化医药行业(药物制剂)专业甲级',
                                         '化工石化医药行业(药物制剂)专业乙级', '化工石化医药行业(医疗器械)专业甲级', '化工石化医药行业(医疗器械)专业乙级', '电力工程监理甲级',
                                         '电力工程监理乙级', '建筑装饰工程设计专项资质丙级', '工程勘察综合资质甲级', '工程勘察专业资质（岩土工程）甲级',
                                         '工程勘察专业资质（岩土工程）乙级', '工程勘察专业资质（岩土工程勘察）甲级', '工程勘察专业资质（岩土工程勘察）乙级',
                                         '工程勘察专业资质（岩土工程勘察）丙级', '工程勘察专业资质（岩土工程设计）甲级', '工程勘察专业资质（岩土工程设计）乙级',
                                         '工程勘察专业资质（岩土工程物探测试检测监测）甲级', '工程勘察专业资质（岩土工程物探测试检测监测）乙级', '工程勘察专业资质（水文地质勘察）甲级',
                                         '工程勘察专业资质（水文地质勘察）乙级', '工程勘察专业资质（水文地质勘察）丙级', '工程勘察专业资质（工程测量）甲级',
                                         '工程勘察专业资质（工程测量）乙级', '工程勘察专业资质（工程测量）丙级', '火电设备安装工程专业承包企业资质一级',
                                         '环境工程设计专项资质（大气污染防治工程）甲级', '环境工程设计专项资质（大气污染防治工程）乙级', '环境工程设计专项资质（固体废物处理处置工程）甲级',
                                         '环境工程设计专项资质（固体废物处理处置工程）乙级', '环境工程设计专项资质（物理污染防治工程）甲级', '环境工程设计专项资质（物理污染防治工程）乙级',
                                         '环境工程设计专项资质（污染修复工程）甲级', '环境工程设计专项资质（污染修复工程）乙级', '区域地质调查综合地质勘查资质甲级',
                                         '区域地质调查综合地质勘查资质乙级', '海洋地质调查综合地质勘查资质甲级', '海洋地质调查综合地质勘查资质乙级',
                                         '石油天然气矿产勘查综合地质勘查资质甲级', '石油天然气矿产勘查综合地质勘查资质乙级', '液体矿产勘查综合地质勘查资质甲级',
                                         '液体矿产勘查综合地质勘查资质乙级', '气体矿产勘查综合地质勘查资质甲级', '气体矿产勘查综合地质勘查资质乙级', '液体矿产勘查综合地质勘查资质丙级',
                                         '固体矿产勘查综合地质勘查资质甲级', '固体矿产勘查综合地质勘查资质乙级', '固体矿产勘查综合地质勘查资质丙级',
                                         '水文地质、工程地质、环境地质调查综合地质勘查资质甲级', '水文地质、工程地质、环境地质调查综合地质勘查资质乙级',
                                         '水文地质、工程地质、环境地质调查综合地质勘查资质丙级', '地球物理勘查专业地质勘查资质甲级', '地球物理勘查专业地质勘查资质乙级',
                                         '地球物理勘查专业地质勘查资质丙级', '地球化学勘查专业地质勘查资质甲级', '地球化学勘查专业地质勘查资质乙级', '地球化学勘查专业地质勘查资质丙级',
                                         '航空地质调查专业地质勘查资质甲级', '航空地质调查专业地质勘查资质乙级', '遥感地质调查专业地质勘查资质甲级', '遥感地质调查专业地质勘查资质乙级',
                                         '地质钻（坑）探专业地质勘查资质甲级', '地质钻（坑）探专业地质勘查资质乙级', '地质钻（坑）探专业地质勘查资质丙级',
                                         '地质实验测试专业地质勘查资质甲级', '地质实验测试专业地质勘查资质乙级', '地质实验测试专业地质勘查资质丙级', '公路工程咨询资质甲级',
                                         '公路工程咨询资质乙级', '公路工程咨询资质丙级', '铁路工程咨询资质甲级', '铁路工程咨询资质乙级', '铁路工程咨询资质丙级',
                                         '城市轨道交通工程咨询资质甲级', '城市轨道交通工程咨询资质乙级', '城市轨道交通工程咨询资质丙级', '民航工程咨询资质甲级',
                                         '民航工程咨询资质乙级', '民航工程咨询资质丙级', '水电工程咨询资质甲级', '水电工程咨询资质乙级', '水电工程咨询资质丙级',
                                         '核电、核工业工程咨询资质甲级', '核电、核工业工程咨询资质乙级', '核电、核工业工程咨询资质丙级', '火电工程咨询资质甲级',
                                         '火电工程咨询资质乙级', '火电工程咨询资质丙级', '煤炭工程咨询资质甲级', '煤炭工程咨询资质乙级', '煤炭工程咨询资质丙级',
                                         '石油天然气工程咨询资质甲级', '石油天然气工程咨询资质乙级', '石油天然气工程咨询资质丙级', '石化工程咨询资质甲级', '石化工程咨询资质乙级',
                                         '石化工程咨询资质丙级', '化工、医药工程咨询资质甲级', '化工、医药工程咨询资质乙级', '化工、医药工程咨询资质丙级',
                                         '建筑材料工程咨询资质甲级', '建筑材料工程咨询资质乙级', '建筑材料工程咨询资质丙级', '机械工程咨询资质甲级', '机械工程咨询资质乙级',
                                         '机械工程咨询资质丙级', '电子工程咨询资质甲级', '电子工程咨询资质乙级', '电子工程咨询资质丙级', '轻工工程咨询资质甲级',
                                         '轻工工程咨询资质乙级', '轻工工程咨询资质丙级', '纺织、化纤工程咨询资质甲级', '纺织、化纤工程咨询资质乙级', '纺织、化纤工程咨询资质丙级',
                                         '钢铁工程咨询资质甲级', '钢铁工程咨询资质乙级', '钢铁工程咨询资质丙级', '有色冶金工程咨询资质甲级', '有色冶金工程咨询资质乙级',
                                         '有色冶金工程咨询资质丙级', '农业工程咨询资质甲级', '农业工程咨询资质乙级', '农业工程咨询资质丙级', '林业工程咨询资质甲级',
                                         '林业工程咨询资质乙级', '林业工程咨询资质丙级', '通信信息工程咨询资质甲级', '通信信息工程咨询资质乙级', '通信信息工程咨询资质丙级',
                                         '广播电影电视工程咨询资质甲级', '广播电影电视工程咨询资质乙级', '广播电影电视工程咨询资质丙级', '水文地质、工程测量、岩土工程工程咨询资质甲级',
                                         '水文地质、工程测量、岩土工程工程咨询资质乙级', '水文地质、工程测量、岩土工程工程咨询资质丙级', '水利工程工程咨询资质甲级',
                                         '水利工程工程咨询资质乙级', '水利工程工程咨询资质丙级', '港口河海工程工程咨询资质甲级', '港口河海工程工程咨询资质乙级',
                                         '港口河海工程工程咨询资质丙级', '生态建设和环境工程工程咨询资质甲级', '生态建设和环境工程工程咨询资质乙级',
                                         '生态建设和环境工程工程咨询资质丙级', '市政公用工程工程咨询资质甲级', '市政公用工程工程咨询资质乙级', '市政公用工程工程咨询资质丙级',
                                         '建筑工程咨询资质甲级', '建筑工程咨询资质乙级', '建筑工程咨询资质丙级', '城市规划工程咨询资质甲级', '城市规划工程咨询资质乙级',
                                         '城市规划工程咨询资质丙级', '综合经济工程咨询资质甲级', '综合经济工程咨询资质乙级', '综合经济工程咨询资质丙级', '地质灾害治理施工甲级',
                                         '地质灾害治理施工乙级', '地质灾害治理施工丙级']

        print("CreeperPlan-mainPage")
        # self.ui = QUiLoader().load("./ui/mainWindowCreeper.ui")
        super(win_CreeperMain, self).__init__()
        self.ui = Ui_MainWindow()
        self.ui.setupUi(self)
        # 方法绑定
        self.creeper_m = creeper_method()
        self.creeper_m.ui = self.ui
        self.ui.btn_login.clicked.connect(self.creeper_m.login_button)
        self.ui.btn_homePageSearch.clicked.connect(self.creeper_m.homePageSearch_button)
        self.ui.btn_searchPageSearch.clicked.connect(self.creeper_m.searchPageSearch_button)
        self.ui.btn_captureData.clicked.connect(self.creeper_m.captureData_button)
        self.ui.btn_qd.clicked.connect(self.creeper_m.chooseToDrive)

        # 地区范围
        self.ui.cb_provincial.addItems(provincial_Level)
        self.ui.cb_provincial.currentIndexChanged.connect(self.creeper_m.chooseProvincial)
        self.ui.cb_city.currentIndexChanged.connect(self.creeper_m.chooseCity)

        # 信息类型
        self.ui.cb_informationType.addItems(information_list)
        self.ui.cb_informationType.currentIndexChanged.connect(self.creeper_m.chooseInformation)

        # 时间选择
        self.ui.cb_dateChoose.clicked.connect(self.creeper_m.chooseDate)

        # 项目金额选择
        self.ui.cb_itemAmount.addItems(itemAmount_list)

        # 采购方式选择
        self.ui.cb_acquisitionMethods.addItems(acquisitionMethods_list)

        # 资金来源选择
        self.ui.cb_capitalSource.addItems(capitalSource_list)

        # 评标办法选择
        self.ui.cb_bidEvaluationMethod.addItems(bidEvaluationMethod_list)

        # 资质证书选择
        self.ui.cb_qualificationCertificate.setEditable(True)
        completer = QCompleter(qualificationCertificate_list)
        completer.setFilterMode(Qt.MatchContains)
        self.ui.cb_qualificationCertificate.setCompleter(completer)
        self.ui.cb_qualificationCertificate.addItems(qualificationCertificate_list)

        # 选择存储位置
        self.ui.btn_choosePosition.clicked.connect(self.creeper_m.chooseToTable)
        if os.path.exists(".\\数据存储"):
            print("exist")
        else:
            print("inexistence")
            os.mkdir(".\\数据存储")
        browser.tablePath = r'{0}\数据存储'.format(os.getcwd())
        self.ui.le_tablePath.setText(browser.tablePath)

        # 打开文档
        self.ui.btn_openExcel.clicked.connect(self.creeper_m.openExcel)

        # webdriver驱动搜索
        for root, lists, files in os.walk(os.getcwd()):
            for file in files:
                if 'chromedriver.exe' in file:
                    browser.webdriverPath = os.path.join(root, file)
                    self.ui.le_driverPath.setText(browser.webdriverPath)
                    print(browser.webdriverPath)
                    break

        # 独立程序_选择文件
        self.ui.btn_chooseDoc.clicked.connect(self.creeper_m.independence_chooseDoc)
        # 独立程序_开始清理
        self.ui.btn_startClean.clicked.connect(self.creeper_m.independdentCleaning)
        # 独立程序_打开文档
        self.ui.btn_openDoc.clicked.connect(self.creeper_m.openDoc)
        # 保存
        self.ui.btn_keep.clicked.connect(self.creeper_m.updateKeywordConfigurations)
        # 退出
        self.ui.btn_quit.clicked.connect(self.creeper_m.appQuit)
        # 切换用户
        self.ui.btn_switchUser.clicked.connect(self.creeper_m.switchUser_button)
        # 修改密码
        self.ui.btn_changePassword.clicked.connect(self.creeper_m.changeUserPasswd)


class win_ChangePasswd(QMainWindow):
    def __init__(self):
        print("CreeperPlan-signInPage")
        super(win_ChangePasswd, self).__init__()
        self.ui = Ui_changePasswd()
        self.ui.setupUi(self)
        # 设置
        self.changePasswd_m = changePasswd_method()
        self.changePasswd_m.ui = self.ui
        # 密码
        passwd_regex = QtCore.QRegularExpression("[a-zA-Z][a-zA-Z0-9_]{2,15}$")
        originalPasswd_validator = QtGui.QRegularExpressionValidator(passwd_regex, self.ui.le_originalPasswd)
        self.ui.le_originalPasswd.setValidator(originalPasswd_validator)
        changePasswd_validator = QtGui.QRegularExpressionValidator(passwd_regex, self.ui.le_changePasswd)
        self.ui.le_changePasswd.setValidator(changePasswd_validator)
        confirmPasswd_validator = QtGui.QRegularExpressionValidator(passwd_regex, self.ui.le_confirmPasswd)
        self.ui.le_confirmPasswd.setValidator(confirmPasswd_validator)

        # 修改方法
        self.ui.btn_change.clicked.connect(self.changePasswd_m.changePasswd_button)
        # 返回方法
        self.ui.btn_return.clicked.connect(self.changePasswd_m.return_button)


if __name__ == "__main__":
    app = QtWidgets.QApplication(sys.argv)
    app.setWindowIcon(QIcon('spider.ico'))
    app.setStyle("Fusion")
    SI.login_win = win_Login()
    SI.signIn_win = win_SignIn()
    SI.creeper_win = win_CreeperMain()
    SI.changePasswd_win = win_ChangePasswd()
    SI.login_win.show()
    sys.exit(app.exec())
